Cocoson23/NUC977/Code/Bare Machine/01-GPIOLED/Driver/Include/rtc.h
#define RTC_SPRCTL_SPRCSTS_Pos           (5)                                               /*!< RTC SPRCTL: SPRCSTS Position           */
#define RTC_SPRCTL_SPRCSTS_Msk           (0x1ul << RTC_SPRCTL_SPRCSTS_Pos)                 /*!< RTC SPRCTL: SPRCSTS Mask               */

#define RTC_SPRCTL_SPRRWRDY_Pos          (7)                                               /*!< RTC SPRCTL: SPRRWRDY Position          */
#define RTC_SPRCTL_SPRRWRDY_Msk          (0x1ul << RTC_SPRCTL_SPRRWRDY_Pos)                /*!< RTC SPRCTL: SPRRWRDY Mask              */

#define RTC_SPR0_SPARE_Pos               (0)                                               /*!< RTC SPR0: SPARE Position               */
#define RTC_SPR0_SPARE_Msk               (0xfffffffful << RTC_SPR0_SPARE_Pos)              /*!< RTC SPR0: SPARE Mask                   */

#define RTC_SPR1_SPARE_Pos               (0)                                               /*!< RTC SPR1: SPARE Position               */
#define RTC_SPR1_SPARE_Msk               (0xfffffffful << RTC_SPR1_SPARE_Pos)              /*!< RTC SPR1: SPARE Mask                   */

#define RTC_SPR2_SPARE_Pos               (0)                                               /*!< RTC SPR2: SPARE Position               */
#define RTC_SPR2_SPARE_Msk               (0xfffffffful << RTC_SPR2_SPARE_Pos)              /*!< RTC SPR2: SPARE Mask                   */

#define RTC_SPR3_SPARE_Pos               (0)                                               /*!< RTC SPR3: SPARE Position               */
#define RTC_SPR3_SPARE_Msk               (0xfffffffful << RTC_SPR3_SPARE_Pos)              /*!< RTC SPR3: SPARE Mask                   */

#define RTC_SPR4_SPARE_Pos               (0)                                               /*!< RTC SPR4: SPARE Position               */
#define RTC_SPR4_SPARE_Msk               (0xfffffffful << RTC_SPR4_SPARE_Pos)              /*!< RTC SPR4: SPARE Mask                   */

#define RTC_SPR5_SPARE_Pos               (0)                                               /*!< RTC SPR5: SPARE Position               */
#define RTC_SPR5_SPARE_Msk               (0xfffffffful << RTC_SPR5_SPARE_Pos)              /*!< RTC SPR5: SPARE Mask                   */

#define RTC_SPR6_SPARE_Pos               (0)                                               /*!< RTC SPR6: SPARE Position               */
#define RTC_SPR6_SPARE_Msk               (0xfffffffful << RTC_SPR6_SPARE_Pos)              /*!< RTC SPR6: SPARE Mask                   */

#define RTC_SPR7_SPARE_Pos               (0)                                               /*!< RTC SPR7: SPARE Position               */
#define RTC_SPR7_SPARE_Msk               (0xfffffffful << RTC_SPR7_SPARE_Pos)              /*!< RTC SPR7: SPARE Mask                   */

#define RTC_SPR8_SPARE_Pos               (0)                                               /*!< RTC SPR8: SPARE Position               */
#define RTC_SPR8_SPARE_Msk               (0xfffffffful << RTC_SPR8_SPARE_Pos)              /*!< RTC SPR8: SPARE Mask                   */

#define RTC_SPR9_SPARE_Pos               (0)                                               /*!< RTC SPR9: SPARE Position               */
#define RTC_SPR9_SPARE_Msk               (0xfffffffful << RTC_SPR9_SPARE_Pos)              /*!< RTC SPR9: SPARE Mask                   */

#define RTC_SPR10_SPARE_Pos              (0)                                               /*!< RTC SPR10: SPARE Position              */
#define RTC_SPR10_SPARE_Msk              (0xfffffffful << RTC_SPR10_SPARE_Pos)             /*!< RTC SPR10: SPARE Mask                  */

#define RTC_SPR11_SPARE_Pos              (0)                                               /*!< RTC SPR11: SPARE Position              */
#define RTC_SPR11_SPARE_Msk              (0xfffffffful << RTC_SPR11_SPARE_Pos)             /*!< RTC SPR11: SPARE Mask                  */

#define RTC_SPR12_SPARE_Pos              (0)                                               /*!< RTC SPR12: SPARE Position              */
#define RTC_SPR12_SPARE_Msk              (0xfffffffful << RTC_SPR12_SPARE_Pos)             /*!< RTC SPR12: SPARE Mask                  */

#define RTC_SPR13_SPARE_Pos              (0)                                               /*!< RTC SPR13: SPARE Position              */
#define RTC_SPR13_SPARE_Msk              (0xfffffffful << RTC_SPR13_SPARE_Pos)             /*!< RTC SPR13: SPARE Mask                  */

#define RTC_SPR14_SPARE_Pos              (0)                                               /*!< RTC SPR14: SPARE Position              */
#define RTC_SPR14_SPARE_Msk              (0xfffffffful << RTC_SPR14_SPARE_Pos)             /*!< RTC SPR14: SPARE Mask                  */

#define RTC_SPR15_SPARE_Pos              (0)                                               /*!< RTC SPR15: SPARE Position              */
#define RTC_SPR15_SPARE_Msk              (0xfffffffful << RTC_SPR15_SPARE_Pos)             /*!< RTC SPR15: SPARE Mask                  */

#define RTC_SPR16_SPARE_Pos              (0)                                               /*!< RTC SPR16: SPARE Position              */
#define RTC_SPR16_SPARE_Msk              (0xfffffffful << RTC_SPR16_SPARE_Pos)             /*!< RTC SPR16: SPARE Mask                  */

#define RTC_SPR17_SPARE_Pos              (0)                                               /*!< RTC SPR17: SPARE Position              */
#define RTC_SPR17_SPARE_Msk              (0xfffffffful << RTC_SPR17_SPARE_Pos)             /*!< RTC SPR17: SPARE Mask                  */

#define RTC_SPR18_SPARE_Pos              (0)                                               /*!< RTC SPR18: SPARE Position              */
#define RTC_SPR18_SPARE_Msk              (0xfffffffful << RTC_SPR18_SPARE_Pos)             /*!< RTC SPR18: SPARE Mask                  */

#define RTC_SPR19_SPARE_Pos              (0)                                               /*!< RTC SPR19: SPARE Position              */
#define RTC_SPR19_SPARE_Msk              (0xfffffffful << RTC_SPR19_SPARE_Pos)             /*!< RTC SPR19: SPARE Mask                  */

/**
  * @brief  RTC define interrupt source
  */
typedef enum {
    RTC_ALARM_INT           =0x01,  /*!< Alarm interrupt */
    RTC_TICK_INT            =0x02,  /*!< Tick interrupt */
    RTC_WAKEUP_INT          =0x04,  /*!< Wake-up interrupt */
    RTC_PSWI_INT            =0x08,  /*!< Power switch interrupt */
    RTC_RELATIVE_ALARM_INT  =0x10,  /*!< Releative Alarm interrupt */
    RTC_KEY_PRESS_INT       =0x20,  /*!< Power Key press interrupt */
    RTC_ALL_INT             =0x3F   /*!< All interrupt */
} RTC_INT_SOURCE;

/**
  * @brief  Define Ioctl commands
  */
typedef enum {
    RTC_IOC_IDENTIFY_LEAP_YEAR      =  0,    /*!< Identify leap year */
    RTC_IOC_SET_TICK_MODE           =  1,    /*!< Set tick mode */
    RTC_IOC_GET_TICK                =  2,    /*!< Get tick count */
    RTC_IOC_RESTORE_TICK            =  3,    /*!< Reset tick count */
    RTC_IOC_ENABLE_INT              =  4,    /*!< Enable RTC interrupt */
    RTC_IOC_DISABLE_INT             =  5,    /*!< Disable RTC interrupt */
    RTC_IOC_SET_CURRENT_TIME        =  6,    /*!< Set current time */
    RTC_IOC_SET_ALAMRM_TIME         =  7,    /*!< set alarm time */
    RTC_IOC_SET_FREQUENCY           =  8,    /*!< Set frequency compensation value */
    RTC_IOC_SET_POWER_ON            =  9,    /*!< Set Power on */
    RTC_IOC_SET_POWER_OFF           =  10,    /*!< Set Power off*/
    RTC_IOC_SET_POWER_OFF_PERIOD    =  11,    /*!< Set Power off period */
    RTC_IOC_ENABLE_HW_POWEROFF      =  12,    /*!< Enable H/W Power off */
    RTC_IOC_DISABLE_HW_POWEROFF     =  13,    /*!< Disable H/W Power off */
    RTC_IOC_GET_POWERKEY_STATUS     =  14,    /*!< Get Power key status */
    RTC_IOC_SET_PSWI_CALLBACK       =  15,    /*!< Set Power switch isr call back function */
    //RTC_IOC_GET_SW_STATUS         =  16,
    //RTC_IOC_SET_SW_STATUS         =  17,
    RTC_IOC_SET_RELEATIVE_ALARM     =  18,    /*!< Set releative alarm */
    //RTC_IOC_SET_POWER_KEY_DELAY   =  19,
    //RTC_IOC_SET_CLOCK_SOURCE      =  20,
    //RTC_IOC_GET_CLOCK_SOURCE      =  21
} E_RTC_CMD;

/**
  * @brief  RTC define Tick mode
  */
typedef enum {
    RTC_TICK_1_SEC       =         0,      /*!< Time tick is 1 second     */
    RTC_TICK_1_2_SEC     =         1,      /*!< Time tick is 1/2 second   */
    RTC_TICK_1_4_SEC     =         2,      /*!< Time tick is 1/4 second   */
    RTC_TICK_1_8_SEC     =         3,      /*!< Time tick is 1/8 second   */
    RTC_TICK_1_16_SEC    =         4,      /*!< Time tick is 1/16 second  */
    RTC_TICK_1_32_SEC    =         5,      /*!< Time tick is 1/32 second  */
    RTC_TICK_1_64_SEC    =         6,      /*!< Time tick is 1/64 second  */
    RTC_TICK_1_128_SEC   =         7       /*!< Time tick is 1/128 second */
} RTC_TICK;

typedef void (PFN_RTC_CALLBACK)(void);  /*!< Call back function \hideinitializer */

/**
  * @brief  RTC current/alarm time select
  */
typedef enum {
    RTC_CURRENT_TIME    =    0,   /*!< Select current time */
    RTC_ALARM_TIME      =    1    /*!< Select alarm time */
} E_RTC_TIME_SELECT;

/**
  * @brief  RTC define Day of week parameter
  */
typedef enum {
    RTC_SUNDAY         =   0,   /*!< Sunday    */
    RTC_MONDAY         =   1,   /*!< Monday    */
    RTC_TUESDAY        =   2,   /*!< Tuesday   */
    RTC_WEDNESDAY      =   3,   /*!< Wednesday */
    RTC_THURSDAY       =   4,   /*!< Thursday  */
    RTC_FRIDAY         =   5,   /*!< Friday    */
    RTC_SATURDAY       =   6    /*!< Saturday  */
} E_RTC_DWR_PARAMETER;

/**
  * @brief  RTC define Time Data Struct
  */
typedef struct {
    UINT8 u8cClockDisplay;            /*!<  12-Hour, 24-Hour */
    UINT8 u8cAmPm;                    /*!<  Time Scale select 12-hr/24-hr */
    UINT32 u32cSecond;                /*!<  Second value */
    UINT32 u32cMinute;                /*!<  Minute value */
    UINT32 u32cHour;                  /*!<  Hour value */
    UINT32 u32cDayOfWeek;             /*!<  Day of week value */
    UINT32 u32cDay;                   /*!<  Day value */
    UINT32 u32cMonth;                 /*!<  Month value */
    UINT32 u32Year;                   /*!<  Year value */
    UINT32 u32AlarmMaskSecond;        /*!<  Alarm mask second */
    UINT32 u32AlarmMaskMinute;        /*!<  Alarm mask minute */
    UINT32 u32AlarmMaskHour;          /*!<  Alarm mask hour */
    PFN_RTC_CALLBACK *pfnAlarmCallBack;    /*!< Alarm ISR call back funstion */
} RTC_TIME_DATA_T;

/**
  * @brief  RTC define Tick Struct
  */
typedef struct {
    UINT8 ucMode;                           /*!< Tick Mode  */
    PFN_RTC_CALLBACK *pfnTickCallBack;      /*!< Tick ISR call back function  */
} RTC_TICK_T;

/*@}*/ /* end of group NUC970_RTC_EXPORTED_CONSTANTS */

/** @addtogroup NUC970_RTC_EXPORTED_FUNCTIONS RTC Exported Functions
  @{
*/

UINT32 RTC_Init(void);
UINT32 RTC_Open(RTC_TIME_DATA_T *sPt);
UINT32 RTC_Ioctl(INT32 i32Num, E_RTC_CMD eCmd, UINT32 u32Arg0, UINT32 u32Arg1);
UINT32 RTC_Read(E_RTC_TIME_SELECT eTime, RTC_TIME_DATA_T *sPt);
UINT32 RTC_Write(E_RTC_TIME_SELECT eTime, RTC_TIME_DATA_T *sPt);
UINT32 RTC_DoFrequencyCompensation(INT32 i32FrequencyX100);
UINT32 RTC_WriteEnable (BOOL bEnable);
UINT32 RTC_Close(void);
void RTC_EnableClock(BOOL bEnable);

/*@}*/ /* end of group NUC970_RTC_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group NUC970_RTC_Driver */

/*@}*/ /* end of group NUC970_Device_Driver */

#ifdef  __cplusplus
}
#endif

#endif /* __DRVRTC_H__ */

/*** (C) COPYRIGHT 2015 Nuvoton Technology Corp. ***/



